def reverseBits(n: int) -> int:
    n = (n >> 1) & 0x55555555 | (n & 0x55555555) << 1  # 交换相邻的两位
    n = (n >> 2) & 0x33333333 | (n & 0x33333333) << 2  # 交换相邻的四位
    n = (n >> 4) & 0x0F0F0F0F | (n & 0x0F0F0F0F) << 4  # 交换相邻的八位
    n = (n >> 8) & 0x00FF00FF | (n & 0x00FF00FF) << 8  # 交换相邻的十六位
    n = (n >> 16) & 0x0000FFFF | (n & 0x0000FFFF) << 16  # 交换相邻的三十二位
    return n


# 测试用例
n1 = 0b00000010100101000001111010011100  # 示例1
n2 = 0b11111111111111111111111111111101  # 示例2

print(reverseBits(n1))  # 输出: 964176192
print(reverseBits(n2))  # 输出: 3221225471

# 分治
